---
kind: other
id: AllMembers.T:Autodesk.Revit.Creation.Application
source: html/f0af1f13-f7a4-cf31-cbbd-9e4a77254659.htm
---
# Application Members

Causes the object to release immediately any resources it may be utilizing.